; domain
(define (domain reaching-multi-subgoal)
    
    (:requirements :typing :negative-preconditions :strips :equality)
    
    (:types 
        gripper - object 
        location - object
    )

    (:predicates
        (is_goal ?loc - location)
        (is_subgoal1 ?loc - location)
        (is_subgoal2 ?loc - location)
        (is_subgoal3 ?loc - location)
        (at ?g - gripper ?loc - location)
    )

    (:action move-to-subgoal1
        :parameters (?g - gripper ?loc - location)
        :precondition (and
            (is_subgoal1 ?loc)
            (not (at ?g ?loc))
        )
        :effect (and
            (at ?g ?loc)
        )
    )

    (:action move-to-subgoal2
        :parameters (?g - gripper ?loc1 ?loc2 - location)
        :precondition (and
            (is_subgoal1 ?loc1)
            (is_subgoal2 ?loc2)
            (at ?g ?loc1)
            (not (at ?g ?loc2))
        )
        :effect (and
            (at ?g ?loc2)
            (not (at ?g ?loc1))
        )
    )

    (:action move-to-subgoal3
        :parameters (?g - gripper ?loc1 ?loc2 - location)
        :precondition (and
            (is_subgoal2 ?loc1)
            (is_subgoal3 ?loc2)
            (at ?g ?loc1)
            (not (at ?g ?loc2))
        )
        :effect (and
            (at ?g ?loc2)
            (not (at ?g ?loc1))
        )
    )

    (:action move-to-goal
        :parameters (?g - gripper ?loc ?goal - location)
        :precondition (and
            (at ?g ?loc)
            (is_goal ?goal)
            (is_subgoal3 ?loc)
            (not (at ?g ?goal))
        )
        :effect (and
            (at ?g ?goal)
            (not (at ?g ?loc))
        )
    )
)

; problem
(define (problem task)
	(:domain reaching-multi-subgoal)
	(:objects claw - gripper subgoal1 subgoal2 subgoal3 goal - location)
	(:init
		(is_goal goal)
        (is_subgoal1 subgoal1)
        (is_subgoal2 subgoal2)
		(is_subgoal3 subgoal3)
	)
	(:goal (and 
		(at claw goal))
	)
)

; plan
1. (move-to-subgoal1 claw subgoal1)
   added: (at claw subgoal1)
   goals met: 0 of 1
2. (move-to-subgoal2 claw subgoal1 subgoal2)
   deleted: (at claw subgoal1)
   added: (at claw subgoal2)
   goals met: 0 of 1
3. (move-to-subgoal3 claw subgoal2 subgoal3)
   deleted: (at claw subgoal2)
   added: (at claw subgoal3)
   goals met: 0 of 1
4. (move-to-goal claw subgoal3 goal)
   deleted: (at claw subgoal3)
   added: (at claw goal)
   goals met: 1 of 1
